src/cfe/КСП/Documents/РеализацияПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияПодарочныхСертификатов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_СкладСписанияСертификатов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ДокументСписанияСертификатов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписаниеТоваровПоТребованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Documents/РеализацияПодарочныхСертификатов/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура КСП_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда 
		
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КСП_ДокументСписанияСертификатов) Тогда
		
		Если НЕ КСП_ДокументСписанияСертификатов.Проведен Тогда 
			
			 ОбъектДокументаСписания = КСП_ДокументСписанияСертификатов.ПолучитьОбъект();
			 ОбъектДокументаСписания.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	Иначе
		
		 СписатьНоменклатуруРеализицииПодарочногоСертификата();
			
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура КСП_ОбработкаУдаленияПроведения(Отказ)
	
	Если Отказ Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КСП_ДокументСписанияСертификатов) Тогда
		
		Если КСП_ДокументСписанияСертификатов.Проведен Тогда 
			
			 ОбъектДокументаСписания = КСП_ДокументСписанияСертификатов.ПолучитьОбъект();
			 ОбъектДокументаСписания.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

	
Процедура СписатьНоменклатуруРеализицииПодарочногоСертификата()
	
	ТаблицаСписанияНоменклатуры = СформироватьТаблицуНоменклатуры(Ссылка);
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("СтатьяРасходов");
	ТаблицаСписанияНоменклатуры.Колонки.Добавить("АналитикаУчетаНоменклатуры");
	
	ТаблицаСписанияНоменклатуры.Заполнить(ксп_ИмпортСлужебный.Настройка("СтатьяСписанияПодарочныхСертификатов","retail"),"СтатьяРасходов"); 
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	
	Для каждого Строка Из ТаблицаСписанияНоменклатуры Цикл
		
		Строка.АналитикаУчетаНоменклатуры = ксп_ИмпортСлужебный.НайтиСоздатьКлючАналитикиНом(Строка.Номенклатура, КСП_СкладСписанияСертификатов, ПустаяХарактеристика);
		
	КонецЦикла;
	                      
	ВнутреннееПотребление = Документы.ВнутреннееПотребление.СоздатьДокумент();
	
	ВнутреннееПотребление.Дата = Ссылка.Дата; 
	ВнутреннееПотребление.Организация = Справочники.Организации.УправленческаяОрганизация;
	ВнутреннееПотребление.Склад = КСП_СкладСписанияСертификатов;
	//ВнутреннееПотребление.ВидЦены = ксп_ИмпортСлужебный.НайтиВидЦены(Деф.ВидЦен,мВнешняяСистема);
    ВнутреннееПотребление.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	ВнутреннееПотребление.Статус = Перечисления.СтатусыВнутреннихПотреблений.Отгружено;
	
	//ВнутреннееПотребление.КассоваяСмена = ксп_ИмпортСлужебный.ПолучитьСсылкуДокументаСПроверкой(Деф.КассоваяСмена, "КассоваяСмена");

	
		
	ВнутреннееПотребление.Товары.Очистить(); 
	ВнутреннееПотребление.Товары.Загрузить(ТаблицаСписанияНоменклатуры);
	
	ВнутреннееПотребление.ОбменДанными.Загрузка = Истина;
	
	ВнутреннееПотребление.Записать(РежимЗаписиДокумента.Проведение);
	
	КСП_ДокументСписанияСертификатов = ВнутреннееПотребление.Ссылка
	
КонецПроцедуры 


Функция СформироватьТаблицуНоменклатуры(Ссылка)
	
	 Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат.Владелец.КСП_НоменклатураСертификата КАК Номенклатура,
		|	КОЛИЧЕСТВО(РеализацияПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат.Владелец.КСП_НоменклатураСертификата) КАК Количество
		|ИЗ
		|	Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК РеализацияПодарочныхСертификатовПодарочныеСертификаты
		|ГДЕ
		|	РеализацияПодарочныхСертификатовПодарочныеСертификаты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат.Владелец.КСП_НоменклатураСертификата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции
